---
type: KeyBasedTreeEntryError
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# KeyBasedTreeEntryError

`Autodesk.Revit.DB.KeyBasedTreeEntryError` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetEntry | 2015 | `public KeyBasedTreeEntry GetEntry ()` |
| Property | ErrorType | 2015 | `public KeyBasedTreeEntryErrorType ErrorType { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |